questions = [

    {
        "text": "Що тобі більше подобається робити?",
        "answers": [
            ("Працювати з технікою", "print"),
            ("Створювати дизайн або працювати з графікою", "design"),
            ("Організовувати роботу та допомагати людям", "info")
        ]
    },

    {
        "text": "Яка діяльність здається цікавішою?",
        "answers": [
            ("Налаштовувати обладнання", "print"),
            ("Створювати макети та дизайн", "design"),
            ("Працювати з документами", "info")
        ]
    },

    {
        "text": "Що тобі ближче?",
        "answers": [
            ("Практична робота з технікою", "print"),
            ("Творча робота за комп'ютером", "design"),
            ("Робота з інформацією", "info")
        ]
    },

    {
        "text": "Чи цікаво тобі створювати цифрові проєкти (наприклад сайти, дизайн або чат-боти)?",
        "answers": [
            ("Так, дуже цікаво", "design"),
            ("Іноді цікаво", "info"),
            ("Більше подобається робота з технікою", "print")
        ]
    },

    {
        "text": "Який результат роботи приносить більше задоволення?",
        "answers": [
            ("Надрукована продукція (книги, плакати)", "print"),
            ("Графіка, дизайн або цифровий продукт", "design"),
            ("Організована робота офісу", "info")
        ]
    },

    {
        "text": "Який тип роботи здається цікавішим?",
        "answers": [
            ("Робота з друкарським обладнанням", "print"),
            ("Робота з комп'ютерними програмами", "design"),
            ("Робота з документами та людьми", "info")
        ]
    }

]

results = {

    "print": {
        "title": "🖨 Друкарська підготовка (поліграфіст → друкар)",

        "text": (
            "Тут навчають працювати з сучасним поліграфічним "
            "обладнанням і створювати друковану продукцію:\n"
            "книги 📓, журнали 📒, плакати 🧾, упаковку 🛍 \n"
            "та навіть гроші 💵💶.\n\n"
            "Ця професія поєднує техніку, точність та "
            "реальний результат роботи."
        )
    },

    "design": {
        "title": "🎨 Додрукарська підготовка (оператор ПК → дизайнер)",

        "text": (
            "Тут навчають працювати з комп'ютерною графікою 💻,\n"
            "створювати дизайн, макети поліграфічної продукції "
            "та працювати з професійними програмами 👨‍💻.\n\n"
            "Цей напрям поєднує творчість 🎨 і сучасні технології 📱."
        )
    },

    "info": {
        "title": "📂 Інформаційна діяльність (секретар, адміністратор, діловод)",

        "text": (
            "Тут навчають працювати з документами 👩‍💻, організовувати \n"
            "роботу офісу 📅, вести діловодство 🗄 та адмініструвати \n"
            "інформаційні процеси.\n\n"
            "Ця професія підходить тим, хто любить порядок, "
            "комунікацію та організацію."
        )
    }

}